<a href="https://colab.research.google.com/github/Vishakha-NITJ/SQL/blob/main/Leetcode%20SQL%2050/Select.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [15]:
import sqlite3
import pandas as pd

def run_query(conn, query):
    cursor = conn.cursor()
    cursor.execute(query)
    return cursor.fetchall()


# Create in-memory DB
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

def execute_query(conn, query):
    df = pd.read_sql_query(query, conn)
    print(df.to_markdown(index=False, tablefmt="github"))

In [16]:
# Create table
cursor.execute("""
CREATE TABLE Products (
    product_id INTEGER PRIMARY KEY,
    low_fats TEXT CHECK (low_fats IN ('Y', 'N')),
    recyclable TEXT CHECK (recyclable IN ('Y', 'N'))
);
""")

# Insert data
cursor.executemany("""
INSERT INTO Products VALUES (?, ?, ?);
""", [
    (0, 'Y', 'N'),
    (1, 'Y', 'Y'),
    (2, 'N', 'Y'),
    (3, 'Y', 'Y'),
    (4, 'N', 'N')
])

##  ðŸŸ¢ 1757. Recyclable and Low Fat Products
### Table: Products

| Column Name | Type |
|------------|------|
| product_id | int  |
| low_fats   | enum |
| recyclable | enum |

- product_id is the primary key (column with unique values) for this table.  
- low_fats is an ENUM (category) of type ('Y', 'N') where 'Y' means this product is low fat and 'N' means it is not.  
- recyclable is an ENUM (category) of types ('Y', 'N') where 'Y' means this product is recyclable and 'N' means it is not.

Write a solution to find the ids of products that are both low fat and recyclable.

Return the result table in any order.

The result format is in the following example.

---

### Example 1:

**Input:**  
**Products Table**

| product_id | low_fats | recyclable |
|------------|----------|------------|
| 0 | Y | N |
| 1 | Y | Y |
| 2 | N | Y |
| 3 | Y | Y |
| 4 | N | N |

---

**Output:**
| product_id |
|------------|
| 1 |
| 3 |

**Explanation:**  
Only products 1 and 3 are both low fat and recyclable.

In [17]:
query = """
SELECT product_id
FROM Products
WHERE low_fats = 'Y'
  AND recyclable = 'Y';
"""

execute_query(conn, query)

|   product_id |
|--------------|
|            1 |
|            3 |

In [18]:
# Create table
cursor.execute("""
CREATE TABLE Customer (
    id INTEGER PRIMARY KEY,
    name TEXT,
    referee_id INTEGER
);
""")

# Insert data
cursor.executemany("""
INSERT INTO Customer VALUES (?, ?, ?);
""", [
    (1, 'Will', None),
    (2, 'Jane', None),
    (3, 'Alex', 2),
    (4, 'Bill', None),
    (5, 'Zack', 1),
    (6, 'Mark', 2)
])

## ðŸŸ¢ 584. Find Customer Referee

### Table: Customer

| Column Name | Type    |
|------------|---------|
| id         | int     |
| name       | varchar |
| referee_id | int     |

- id is the primary key (column with unique values) for this table.  
- Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.  
- referee_id can be NULL, which means the customer was not referred by anyone.

Write a solution to find the names of customers who are either:
- not referred by customer with id = 2, or  
- not referred by any customer.

Return the result table in any order.

The result format is in the following example.

---

### Example 1:

**Input:**  
**Customer Table**

| id | name | referee_id |
|----|------|------------|
| 1  | Will | null       |
| 2  | Jane | null       |
| 3  | Alex | 2          |
| 4  | Bill | null       |
| 5  | Zack | 1          |
| 6  | Mark | 2          |

---

**Output:**

| name |
|------|
| Will |
| Jane |
| Bill |
| Zack |

**Explanation:**  
Customers **Will**, **Jane**, and **Bill** were not referred by anyone, and **Zack** was referred by customer with id â‰  2.

In [19]:
query = """
SELECT name
FROM Customer
WHERE referee_id != 2
  OR referee_id IS NULL;
"""

execute_query(conn, query)

| name   |
|--------|
| Will   |
| Jane   |
| Bill   |
| Zack   |

In [20]:
# Create table
cursor.execute("""
CREATE TABLE World (
    name TEXT PRIMARY KEY,
    continent TEXT,
    area INTEGER,
    population INTEGER,
    gdp INTEGER
);
""")

# Insert data
cursor.executemany("""
INSERT INTO World VALUES (?, ?, ?, ?, ?);
""", [
    ('Afghanistan', 'Asia', 652230, 25500100, 20343000000),
    ('Albania', 'Europe', 28748, 2831741, 12960000000),
    ('Algeria', 'Africa', 2381741, 37100000, 188681000000),
    ('Andorra', 'Europe', 468, 78115, 3712000000),
    ('Angola', 'Africa', 1246700, 20609294, 100990000000)
])

## ðŸŸ¢ 595. Big Countries

### Table: World

| Column Name | Type    |
|------------|---------|
| name       | varchar |
| continent  | varchar |
| area       | int     |
| population | int     |
| gdp        | bigint  |

- `name` is the primary key (column with unique values) for this table.  
- Each row gives information about a countryâ€™s name, continent, area, population, and GDP.  

A country is **big** if:
- it has an area of at least **3,000,000 kmÂ²**, **OR**
- it has a population of at least **25,000,000**

Write a solution to find the **name, population, and area** of the big countries.

Return the result table in any order.

---

### Example 1:

**Input:**  
**World Table**

| name        | continent | area    | population | gdp          |
|------------|-----------|---------|------------|--------------|
| Afghanistan | Asia      | 652230  | 25500100   | 20343000000  |
| Albania     | Europe    | 28748   | 2831741    | 12960000000  |
| Algeria     | Africa    | 2381741 | 37100000   | 188681000000 |
| Andorra     | Europe    | 468     | 78115      | 3712000000   |
| Angola      | Africa    | 1246700 | 20609294   | 100990000000 |

---

**Output:**

| name        | population | area    |
|------------|------------|---------|
| Afghanistan | 25500100   | 652230  |
| Algeria     | 37100000   | 2381741 |

**Explanation:**  
Afghanistan qualifies due to population â‰¥ 25,000,000.  
Algeria qualifies due to population â‰¥ 25,000,000.

In [21]:
query = """
SELECT name, population, area
FROM World
WHERE area >= 3000000
  OR population >= 25000000;
"""

execute_query(conn, query)

| name        |   population |    area |
|-------------|--------------|---------|
| Afghanistan |     25500100 |  652230 |
| Algeria     |     37100000 | 2381741 |

In [22]:
# Create table
cursor.execute("""
CREATE TABLE Views (
    article_id INTEGER,
    author_id INTEGER,
    viewer_id INTEGER,
    view_date DATE
);
""")

# Insert sample data
cursor.executemany("""
INSERT INTO Views VALUES (?, ?, ?, ?);
""", [
    (1, 3, 5, '2019-08-01'),
    (1, 3, 6, '2019-08-02'),
    (2, 7, 7, '2019-08-01'),
    (2, 7, 6, '2019-08-02'),
    (4, 7, 1, '2019-07-22'),
    (3, 4, 4, '2019-07-21'),
    (3, 4, 4, '2019-07-21')
])

## ðŸŸ¢ 1148. Article Views I

### Table: Views

| Column Name | Type |
|------------|------|
| article_id | int  |
| author_id  | int  |
| viewer_id  | int  |
| view_date  | date |

- There is no primary key for this table; the table may contain duplicate rows.  
- Each row indicates that a viewer viewed an article (written by some author) on some date.  
- Note that if `author_id = viewer_id`, it means the author viewed their own article.

Write a solution to find **all authors that viewed at least one of their own articles**.

Return the result table **sorted by id in ascending order**.

---

### Example 1:

**Input:**  
**Views Table**

| article_id | author_id | viewer_id | view_date  |
|------------|-----------|-----------|------------|
| 1          | 3         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |

---

**Output:**

| id |
|----|
| 4  |
| 7  |

**Explanation:**  
- Author `4` viewed their own article (`article_id = 3`).  
- Author `7` viewed their own article (`article_id = 2`).  
All other authors did not view their own articles.

In [23]:
query = """
SELECT DISTINCT author_id AS id
FROM Views
WHERE author_id = viewer_id
ORDER BY id;
"""
execute_query(conn, query)

|   id |
|------|
|    4 |
|    7 |